[
  {
    "original": "Omishe di dole eyovi",
    "translation": "All things are possible",
    "explanation": "This expression encourages perseverance and optimism. It suggests that with effort and determination, one can achieve what might seem impossible."
  },
  {
    "original": "Olupale ihalu ningwa olumwe",
    "translation": "A village is not built in a day",
    "explanation": "Similar to 'Rome wasn't built in a day,' this proverb teaches patience and persistence in working toward significant goals."
  },
  {
    "original": "Okayaxa oyaka fikilwa",
    "translation": "Every hunter will one day be hunted",
    "explanation": "This proverb warns that those who harm others will eventually face consequences themselves. It encourages ethical behavior."
  },
  {
    "original": "Omunwe umwe ihau tondoka outa",
    "translation": "One finger cannot press a bow",
    "explanation": "This emphasizes the importance of cooperation and community. Some tasks require collective effort to succeed."
  },
  {
    "original": "Efuma esi da nale itali tu oshikutu",
    "translation": "An old bead doesn't make clothing",
    "explanation": "This suggests that clinging to the past or outdated ways may not be helpful for current challenges. Innovation and adaptability are important."
  },
  {
    "original": "Oshimbodi o hashi li ondjupa",
    "translation": "A mamba eats a python",
    "explanation": "This proverb reminds us that even the powerful can be overcome, and no one is invincible."
  },
  {
    "original": "Omunhu oshihupelo",
    "translation": "A person is a river ford",
    "explanation": "Just as a ford helps people cross a river, humans should help each other overcome life's challenges. This emphasizes community and mutual support."
  },
  {
    "original": "Oludi oludi itali ningine ombabi",
    "translation": "A species will not turn into another species",
    "explanation": "This proverb emphasizes the importance of accepting one's nature and identity. It suggests that people should be true to themselves."
  }
]
